export const initText = 'youngwookim.me Terminal\n' + '(c) Young-Woo Kim. All rights reserved.';

export const helpText =
  'cd : 페이지 이동\n' +
  'ls | dir : 페이지 목록\n' +
  'theme {dark | light} : 테마 변경\n' +
  'clear | cls : 터미널 초기화\n' +
  'help : 도웁말 출력\n' +
  'exit: 메뉴 닫기';

export const fortuneTexts = [
  '(자연대 건물에 컴공 출신 범죄자가 숨어들었다.)\n' +
    '경찰: 당신 컴공이지?\n' +
    '컴공: 아닌데요.\n' +
    '경찰: 2!=2는 참인가 거짓인가?\n' +
    '컴공: 거짓이죠.\n' +
    '경찰: 끌고 가.\n',
  '어느 한 컴퓨터공학과 학생이 유명한 교수님을 찾아가 물었다.\n' +
    '"재귀 함수가 뭔가요?"\n' +
    '"잘 들어보게. 옛날에 산꼭대기에 현자가 있었어. 질문엔 모두 지혜롭게 대답해 주었지.\n' +
    '그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어.\n' +
    '  "재귀 함수가 뭔가요?"\n' +
    '  "잘 들어보게. 옛날에 산꼭대기..."\n',
  '0과 1로만 이루어진 기차가 뭐게요~?\n' + 'binary는 호남선~\n' + 'num row column char에~',
  'A: long 패딩보다 긴 건 뭔지 아세요?\n' +
    'B: double 코트\n' +
    'A: 그럼 짧은 건?\n' +
    'B: int 패딩\n',
  '<자바는 자바스크립트가 궁금해>\n' +
    '사람들은 종종 물어본다\n' +
    '그와 무슨 사이냐고.\n' +
    '나는 대답한다\n' +
    '아무 사이 아니라고.\n' +
    '사람들이 계속 물어봐서 일까?\n' +
    '나와 비슷한 그 사람이 신경 쓰인다.\n' +
    '그는 나를 알까?\n' +
    '그는 내 이름을 알까?\n' +
    '나와 같은 질문을 받을까?\n' +
    '어느샌가 그 사람 생각뿐이다.\n',
  '개발은 B(버그)와\n' + 'D(디버깅) 사이의\n' + 'C(카페인)이다.\n',
  'Q: 개발자들이 가장 좋아하는 운동은?\n' + 'A: 머신러닝\n',
  '코드 한 줄에 추억과\n' +
    '에러 한 줄에 눈물과\n' +
    '디버그 한 줄에 사랑과\n' +
    '리뷰 한 줄에 쓸쓸함과\n' +
    '머지 한 줄에 행복과\n' +
    '푸시 한 줄에 개발자\n',
  '"세상의 모든 것들은 변해요.\n' +
    '심지어 사람은 6년 뒤면 세포 하나까지도 같은 점이 없다고 해요.\n' +
    '테세우스의 배 같은거죠.\n' +
    '그래서 전 알고리즘이 좋아요.\n' +
    '어떤 상황에도 흔들리지 않는 완전무결한 시스템을 내 손으로 만들어내는 거니까요.\n' +
    '영우씨는 어떠세요?"\n\n' +
    '"화장실 좀 다녀올게요."\n',
  '어느 컴공과 학생이 인문계 건물로 침입했다.\n' +
    '경비원은 사람들을 모아놓고 질문을 하였다.\n' +
    '[ ★ ★ ♥ ★ ★ ]\n' +
    '"하트의 위치는 몇번째인가?"\n' +
    '그중 한 명이 대답하길\n' +
    '"0... 1... 2... 두 번째요!"\n' +
    '"쟤 잡아."\n',
];
